<a href="https://colab.research.google.com/github/Babatunde-source/Data-science-batch-A/blob/main/data_cleansed.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd

In [4]:
df= pd.read_csv("/content/results.csv")
df

             date            home_team  ...        country  neutral
0      1872-11-30             Scotland  ...       Scotland    False
1      1873-03-08              England  ...        England    False
2      1874-03-07             Scotland  ...       Scotland    False
3      1875-03-06              England  ...        England    False
4      1876-03-04             Scotland  ...       Scotland    False
...           ...                  ...  ...            ...      ...
42423  2021-07-06  Trinidad and Tobago  ...  United States     True
42424  2021-07-07              England  ...        England    False
42425  2021-07-09                 Peru  ...         Brazil     True
42426  2021-07-10               Brazil  ...         Brazil    False
42427  2021-07-11              England  ...        England    False

[42428 rows x 9 columns]

In [5]:
# to print the first five rows
df.head()

         date home_team away_team  ...     city   country neutral
0  1872-11-30  Scotland   England  ...  Glasgow  Scotland   False
1  1873-03-08   England  Scotland  ...   London   England   False
2  1874-03-07  Scotland   England  ...  Glasgow  Scotland   False
3  1875-03-06   England  Scotland  ...   London   England   False
4  1876-03-04  Scotland   England  ...  Glasgow  Scotland   False

[5 rows x 9 columns]

In [6]:
# to list columns
df.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral'],
      dtype='object')

In [7]:
# randomly select five rows
df.sample(5)

             date      home_team  ...        country  neutral
25014  2002-09-07  Faroe Islands  ...  Faroe Islands    False
39586  2018-01-15          Libya  ...        Morocco     True
10150  1977-05-29      Argentina  ...      Argentina    False
31810  2009-11-14         Poland  ...         Poland    False
41755  2020-10-11       Scotland  ...       Scotland    False

[5 rows x 9 columns]

In [8]:
# to check for missing value in boolean
df.isnull()

        date  home_team  away_team  ...   city  country  neutral
0      False      False      False  ...  False    False    False
1      False      False      False  ...  False    False    False
2      False      False      False  ...  False    False    False
3      False      False      False  ...  False    False    False
4      False      False      False  ...  False    False    False
...      ...        ...        ...  ...    ...      ...      ...
42423  False      False      False  ...  False    False    False
42424  False      False      False  ...  False    False    False
42425  False      False      False  ...  False    False    False
42426  False      False      False  ...  False    False    False
42427  False      False      False  ...  False    False    False

[42428 rows x 9 columns]

In [9]:
# columns with NAN
df.isnull().sum()

date          0
home_team     0
away_team     0
home_score    0
away_score    0
tournament    0
city          0
country       0
neutral       0
dtype: int64

In [10]:
# columns with NAN in boolean
df.isnull().any()

date          False
home_team     False
away_team     False
home_score    False
away_score    False
tournament    False
city          False
country       False
neutral       False
dtype: bool

In [11]:
df.isnull().any().any()

False

In [12]:
# to know the number of rows and columns respectively
df.shape

(42428, 9)

In [13]:
df= pd.read_csv("/content/shootouts.csv")
df

           date            home_team         away_team               winner
0    1967-08-22                India            Taiwan               Taiwan
1    1971-11-14          South Korea  Vietnam Republic          South Korea
2    1972-05-17             Thailand       South Korea          South Korea
3    1972-05-19             Thailand          Cambodia             Thailand
4    1973-07-26             Malaysia            Kuwait             Malaysia
..          ...                  ...               ...                  ...
424  2021-07-06                Italy             Spain                Italy
425  2021-07-06  Trinidad and Tobago     French Guiana  Trinidad and Tobago
426  2021-07-06            Argentina          Colombia            Argentina
427  2021-07-06            Guatemala        Guadeloupe           Guadeloupe
428  2021-07-11              England             Italy                Italy

[429 rows x 4 columns]

In [14]:
# to print the first five rows
df.head()

         date    home_team         away_team       winner
0  1967-08-22        India            Taiwan       Taiwan
1  1971-11-14  South Korea  Vietnam Republic  South Korea
2  1972-05-17     Thailand       South Korea  South Korea
3  1972-05-19     Thailand          Cambodia     Thailand
4  1973-07-26     Malaysia            Kuwait     Malaysia

In [15]:
# to print at random five rows
df.sample(5)

           date   home_team     away_team        winner
151  1995-11-28  Mauritania  Sierra Leone  Sierra Leone
105  1990-02-20    Colombia        Russia      Colombia
317  2006-04-30   Mauritius    Mozambique    Mozambique
187  1998-05-29     Morocco        France       Morocco
329  2007-07-22        Iran   South Korea   South Korea

In [16]:
# to print the columns
df.columns

Index(['date', 'home_team', 'away_team', 'winner'], dtype='object')

In [17]:
# to check for missing value
df.isnull()

      date  home_team  away_team  winner
0    False      False      False   False
1    False      False      False   False
2    False      False      False   False
3    False      False      False   False
4    False      False      False   False
..     ...        ...        ...     ...
424  False      False      False   False
425  False      False      False   False
426  False      False      False   False
427  False      False      False   False
428  False      False      False   False

[429 rows x 4 columns]

In [18]:
# columns with NAN
df.isnull().sum()

date         0
home_team    0
away_team    0
winner       0
dtype: int64

In [19]:
# columns with NAN in boolean
df.isnull().any()

date         False
home_team    False
away_team    False
winner       False
dtype: bool

In [20]:
df.isnull().any().any()

False

In [21]:
# to know the number of rows and columns respectively
df.shape

(429, 4)

In [22]:
df.to_excel(r'data cleansed.xlsx',index= False)